app/controllers/words_controller.rb

SELECT "words".* FROM "words" WHERE "words"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @word = Word.find(params[:id])

INSERT INTO "words" ("created_at", "type", "updated_at", "word") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Oct 2011 01:47:31 UTC +00:00], ["type", nil], ["updated_at", Fri, 28 Oct 2011 01:47:31 UTC +00:00], ["word", "decision-trees"]]
---
  def create
    @word = Word.new(params[:word])

    respond_to do |format|
      if @word.save